KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_test.c
/*
 * Copyright (c) 2020 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include "radio_test.h"
#include "radio_node.h"
#include "local_config.h"
#include <string.h>
#include <inttypes.h>
#include <limits.h>

#if !(defined(CONFIG_SOC_SERIES_NRF54HX) || defined(CONFIG_SOC_SERIES_NRF54LX))
#include <hal/nrf_power.h>
#endif /* !(defined(CONFIG_SOC_SERIES_NRF54HX) || defined(CONFIG_SOC_SERIES_NRF54LX)) */

#ifdef NRF53_SERIES
#include <hal/nrf_vreqctrl.h>
#endif /* NRF53_SERIES */

#include <nrfx_timer.h>
#include <zephyr/kernel.h>
#include <zephyr/random/random.h>
#include <zephyr/sys/util.h>

#include <hal/nrf_egu.h>
#include <helpers/nrfx_gppi.h>

#if CONFIG_FEM
#include "fem_al/fem_al.h"
#endif /* CONFIG_FEM */

#if NRF54H_ERRATA_216_PRESENT
#include <zephyr/drivers/mbox.h>
#endif /* NRF54H_ERRATA_216_PRESENT */

/* IEEE 802.15.4 default frequency. */
#define IEEE_DEFAULT_FREQ         (5)
/* Length on air of the LENGTH field. */
#define RADIO_LENGTH_LENGTH_FIELD (8UL)

#define RADIO_TEST_EGU_EVENT NRF_EGU_EVENT_TRIGGERED0
#define RADIO_TEST_EGU_TASK  NRF_EGU_TASK_TRIGGER0

/* Frequency calculation for a given channel in the IEEE 802.15.4 radio
 * mode.
 */
#define IEEE_FREQ_CALC(_channel) (IEEE_DEFAULT_FREQ + \
				 (IEEE_DEFAULT_FREQ * \
				 ((_channel) - IEEE_MIN_CHANNEL)))
/* Frequency calculation for a given channel. */
#define CHAN_TO_FREQ(_channel) (2400 + _channel)

#if defined(CONFIG_SOC_SERIES_NRF54HX)
	#define RADIO_TEST_EGU                     NRF_EGU020
	#define RADIO_TEST_TIMER_INSTANCE          020
	#define RADIO_TEST_TIMER_IRQn              TIMER020_IRQn
	#define RADIO_TEST_RADIO_IRQn              RADIO_0_IRQn
	#define RADIO_TEST_SHORT_END_DISABLE_MASK  NRF_RADIO_SHORT_PHYEND_DISABLE_MASK
	#define RADIO_TEST_INT_END_MASK            NRF_RADIO_INT_PHYEND_MASK
	#define RADIO_TEST_EVENT_END               NRF_RADIO_EVENT_PHYEND
#elif defined(CONFIG_SOC_SERIES_NRF54LX)
	#define RADIO_TEST_EGU                     NRF_EGU10
	#define RADIO_TEST_TIMER_INSTANCE          10
	#define RADIO_TEST_TIMER_IRQn              TIMER10_IRQn
	#define RADIO_TEST_RADIO_IRQn              RADIO_0_IRQn
	#define RADIO_TEST_SHORT_END_DISABLE_MASK  NRF_RADIO_SHORT_PHYEND_DISABLE_MASK
	#define RADIO_TEST_INT_END_MASK            NRF_RADIO_INT_PHYEND_MASK
	#define RADIO_TEST_EVENT_END               NRF_RADIO_EVENT_PHYEND
#else
	#define RADIO_TEST_EGU                     NRF_EGU0
	#define RADIO_TEST_TIMER_INSTANCE          0
	#define RADIO_TEST_TIMER_IRQn              TIMER0_IRQn
	#define RADIO_TEST_RADIO_IRQn              RADIO_IRQn
	#define RADIO_TEST_SHORT_END_DISABLE_MASK  NRF_RADIO_SHORT_END_DISABLE_MASK
	#define RADIO_TEST_INT_END_MASK            NRF_RADIO_INT_END_MASK
	#define RADIO_TEST_EVENT_END               NRF_RADIO_EVENT_END
#endif /* defined(CONFIG_SOC_SERIES_NRF54HX) */

#define ENDPOINT_EGU_RADIO_TX    BIT(1)
#define ENDPOINT_EGU_RADIO_RX    BIT(2)
#define ENDPOINT_TIMER_RADIO_TX  BIT(3)
#define ENDPOINT_FORK_EGU_TIMER  BIT(4)

/* RX timeout counted from the last packet received. */
#define RX_PACKET_TIMEOUT_MS 100

/* Buffer for the radio TX packet */
static uint8_t tx_packet[RADIO_MAX_PAYLOAD_LEN];
/* Buffer for the radio RX packet. */
static uint8_t rx_packet[RADIO_MAX_PAYLOAD_LEN];
/* Number of transmitted packets. */
static uint32_t tx_packet_cnt;
/* Number of received packets with valid CRC. */
static uint32_t rx_packet_cnt;

/* Radio current channel (frequency). */
static uint8_t current_channel;

static int16_t radio_get_rssi_dbm(void)
{
	/* Trigger RSSISTART for ambient/monitor use and wait for measurement.
	 * For per-packet RSSI, use radio_read_last_rx_rssi_dbm() instead, which
	 * reads the hardware auto-updated RSSISAMPLE from packet reception. */
	nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_RSSISTART);
	k_busy_wait(250);

	/* RSSISAMPLE is encoded as positive magnitude of a negative dBm value. */
	int16_t rssi_dbm = -(int16_t)nrf_radio_rssi_sample_get(NRF_RADIO);

	/* If hardware reports invalid/sentinel values, expose as unavailable. */
	if (rssi_dbm <= -127) {
		return INT16_MIN;
	}

	return rssi_dbm;
}

/* Read RSSI of the most recently received packet.
 * RSSISTART is triggered at ADDRESS event; by CRCOK the sample is ready. */
static int16_t radio_read_last_rx_rssi_dbm(void)
{
	int16_t rssi_dbm = -(int16_t)nrf_radio_rssi_sample_get(NRF_RADIO);

	if (rssi_dbm <= -127) {
		return INT16_MIN;
	}

	return rssi_dbm;
}

bool radio_test_sample_rssi_dbm(int16_t *rssi_dbm)
{
	int16_t sample;

	if (rssi_dbm == NULL) {
		return false;
	}

	sample = radio_get_rssi_dbm();
	if (sample == INT16_MIN) {
		return false;
	}

	*rssi_dbm = sample;
	return true;
}

/* Timer used for channel sweeps and tx with duty cycle. */
static nrfx_timer_t timer =
	NRFX_TIMER_INSTANCE(NRF_TIMER_INST_GET(RADIO_TEST_TIMER_INSTANCE));

static bool sweep_processing;

/* Total payload size */
static uint16_t total_payload_size;

/* PPI channel for starting radio */
static nrfx_gppi_handle_t ppi_radio_start;

/* PPI endpoint status.*/
static atomic_t endpoint_state;

/*  Work element used to handle the end of packet reception. */
static void rx_timeout_work_handler(struct k_work *work);
K_WORK_DELAYABLE_DEFINE(rx_timeout_work, rx_timeout_work_handler);

/* Pointer to rx timeout callback function. */
static void (**rx_timeout_cb)(void);

static volatile bool cancel_request;
static volatile bool test_is_running;

#define RADIO_PROTO_MAGIC0             0xA5 				//Frame Delimiter
#define RADIO_PROTO_MAGIC1             0x5A 				//Frame Delimiter
#define RADIO_PROTO_VERSION            1						//Future Proof
#define RADIO_PROTO_HEADER_SIZE        19

static enum radio_proto_role proto_role = RADIO_PROTO_ROLE_DISABLED;
static uint32_t proto_local_signature;
static enum radio_survey_node_type proto_local_node_type = RADIO_SURVEY_NODE_TYPE_X;
static bool proto_local_is_aggregator;
static uint8_t proto_seq;
static uint32_t proto_discover_req_seen;
static uint32_t proto_discover_rsp_seen;
static uint32_t proto_test_data_seen;
static uint32_t proto_per_req_seen;
static uint32_t proto_per_rsp_seen;
static uint32_t proto_local_test_data_rx;
static bool proto_test_session_active;
static uint32_t proto_test_session_broadcaster;
static struct radio_proto_peer proto_peers[RADIO_PROTO_MAX_PEERS];
static uint8_t proto_peer_count;

static bool proto_tx_override_valid;
static uint8_t proto_tx_override_payload[IEEE_MAX_PAYLOAD_LEN];
static uint8_t proto_tx_override_len;

