KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_test.c
static uint32_t proto_local_profile_pack(void)
{
	uint32_t profile = ((uint32_t)proto_local_node_type & RADIO_SURVEY_PROFILE_TYPE_MASK);

	if (proto_local_is_aggregator) {
		profile |= RADIO_SURVEY_PROFILE_AGGREGATOR_BIT;
	}

	return profile;
}

static void proto_peer_profile_apply(struct radio_proto_peer *peer, uint32_t aux_signature)
{
	uint8_t type = (uint8_t)(aux_signature & RADIO_SURVEY_PROFILE_TYPE_MASK);

	if (peer == NULL) {
		return;
	}

	if (type == (uint8_t)RADIO_SURVEY_NODE_TYPE_X ||
	    type == (uint8_t)RADIO_SURVEY_NODE_TYPE_Y) {
		peer->node_type = type;
	} else {
		peer->node_type = RADIO_SURVEY_NODE_TYPE_UNKNOWN;
	}

	peer->is_data_aggregator = (aux_signature & RADIO_SURVEY_PROFILE_AGGREGATOR_BIT) != 0u;
}

static struct radio_proto_peer *proto_find_or_add_peer(uint32_t signature)
{
	for (uint8_t i = 0; i < proto_peer_count; i++) {
		if (proto_peers[i].signature == signature) {
			return &proto_peers[i];
		}
	}

	if (proto_peer_count >= ARRAY_SIZE(proto_peers)) {
		return NULL;
	}

	struct radio_proto_peer *peer = &proto_peers[proto_peer_count++];

	memset(peer, 0, sizeof(*peer));
	peer->signature = signature;

	return peer;
}

static bool proto_frame_decode(const uint8_t *payload, uint8_t payload_len,
			       struct radio_proto_frame *frame)
{
	if (payload_len < RADIO_PROTO_HEADER_SIZE) {
		return false;
	}

	if (payload[0] != RADIO_PROTO_MAGIC0 ||
	    payload[1] != RADIO_PROTO_MAGIC1 ||
	    payload[2] != RADIO_PROTO_VERSION) {
		return false;
	}

	frame->cmd = payload[3];
	frame->flags = payload[4];
	frame->src_signature = proto_u32_get_le(&payload[5]);
	frame->dst_signature = proto_u32_get_le(&payload[9]);
	frame->aux_signature = proto_u32_get_le(&payload[13]);
	frame->value = proto_u16_get_le(&payload[17]);

	return true;
}

static uint8_t proto_frame_encode(uint8_t *payload, size_t payload_capacity,
			      enum radio_proto_cmd cmd,
			      uint32_t src_signature,
			      uint32_t dst_signature,
			      uint32_t aux_signature,
			      uint16_t value)
{
	if (payload_capacity < RADIO_PROTO_HEADER_SIZE) {
		return 0;
	}

	payload[0] = RADIO_PROTO_MAGIC0;
	payload[1] = RADIO_PROTO_MAGIC1;
	payload[2] = RADIO_PROTO_VERSION;
	payload[3] = (uint8_t)cmd;
	payload[4] = proto_seq++;
	proto_u32_put_le(&payload[5], src_signature);
	proto_u32_put_le(&payload[9], dst_signature);
	proto_u32_put_le(&payload[13], aux_signature);
	proto_u16_put_le(&payload[17], value);

	return RADIO_PROTO_HEADER_SIZE;
}

static uint8_t proto_frame_encode_raw(uint8_t *payload, size_t payload_capacity,
			      enum radio_proto_cmd cmd,
			      uint8_t flags,
			      uint32_t src_signature,
			      uint32_t dst_signature,
			      uint32_t aux_signature,
			      uint16_t value)
{
	if (payload_capacity < RADIO_PROTO_HEADER_SIZE) {
		return 0;
	}

	payload[0] = RADIO_PROTO_MAGIC0;
	payload[1] = RADIO_PROTO_MAGIC1;
	payload[2] = RADIO_PROTO_VERSION;
	payload[3] = (uint8_t)cmd;
	payload[4] = flags;
	proto_u32_put_le(&payload[5], src_signature);
	proto_u32_put_le(&payload[9], dst_signature);
	proto_u32_put_le(&payload[13], aux_signature);
	proto_u16_put_le(&payload[17], value);

	return RADIO_PROTO_HEADER_SIZE;
}

static bool proto_frame_for_me(uint32_t dst_signature)
{
	return (dst_signature == RADIO_PROTO_BROADCAST_SIG) ||
	       (dst_signature == proto_local_signature);
}

void radio_proto_schedule_response(enum radio_proto_cmd cmd, uint32_t dst_signature, uint16_t value)
{
	radio_proto_schedule_response_ext(cmd, dst_signature, value, 0u);
}

void radio_proto_schedule_response_ext(enum radio_proto_cmd cmd, uint32_t dst_signature,
				       uint16_t value, uint32_t aux_signature)
{
	if (proto_role != RADIO_PROTO_ROLE_RX) {
		return;
	}

	proto_rsp_cmd = cmd;
	proto_rsp_dst_sig = dst_signature;
	proto_rsp_value = value;
	proto_rsp_aux_sig = aux_signature;
	proto_rsp_pending = true;

	/* Spread responder transmissions and leave time for TX node to switch to RX. */
	k_work_reschedule(&proto_rsp_work, K_MSEC((sys_rand32_get() % 25u) + 15u));
}

static void radio_config(nrf_radio_mode_t mode, enum transmit_pattern pattern)
{
	nrf_radio_packet_conf_t packet_conf;

	/* Set fast ramp-up time. */
#if defined(CONFIG_SOC_SERIES_NRF54HX) || defined(CONFIG_SOC_SERIES_NRF54LX)
	nrf_radio_fast_ramp_up_enable_set(NRF_RADIO, true);
#else
	nrf_radio_modecnf0_set(NRF_RADIO, true, RADIO_MODECNF0_DTX_Center);
#endif /* defined(CONFIG_SOC_SERIES_NRF54HX) || defined(CONFIG_SOC_SERIES_NRF54LX) */

	/* Disable CRC. */
	nrf_radio_crc_configure(NRF_RADIO, RADIO_CRCCNF_LEN_Disabled,
				NRF_RADIO_CRC_ADDR_INCLUDE, 0);

	/* Set the device address 0 to use when transmitting. */
	nrf_radio_txaddress_set(NRF_RADIO, 0);
	/* Enable the device address 0 to use to select which addresses to
	 * receive
	 */
	nrf_radio_rxaddresses_set(NRF_RADIO, 1);

	/* Set the address according to the transmission pattern. */
	switch (pattern) {
	case TRANSMIT_PATTERN_RANDOM:
		nrf_radio_prefix0_set(NRF_RADIO, 0xAB);
		nrf_radio_base0_set(NRF_RADIO, 0xABABABAB);
		break;

	case TRANSMIT_PATTERN_11001100:
		nrf_radio_prefix0_set(NRF_RADIO, 0xCC);
		nrf_radio_base0_set(NRF_RADIO, 0xCCCCCCCC);
		break;

	case TRANSMIT_PATTERN_11110000:
		nrf_radio_prefix0_set(NRF_RADIO, 0x6A);
		nrf_radio_base0_set(NRF_RADIO, 0x58FE811B);
		break;

	default:
		return;
	}

	/* Packet configuration:
	 * payload length size = 8 bits,
	 * 0-byte static length, max 255-byte payload,
	 * 4-byte base address length (5-byte full address length),
	 * Bit 24: 1 Big endian,
	 * Bit 25: 1 Whitening enabled.
	 */
	memset(&packet_conf, 0, sizeof(packet_conf));
	packet_conf.lflen = RADIO_LENGTH_LENGTH_FIELD;
	packet_conf.maxlen = (sizeof(tx_packet) - 1);
	packet_conf.statlen = 0;
	packet_conf.balen = 4;
	packet_conf.big_endian = true;
	packet_conf.whiteen = true;

	switch (mode) {
#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	case NRF_RADIO_MODE_IEEE802154_250KBIT:
		/* Packet configuration:
		 * S1 size = 0 bits,
		 * S0 size = 0 bytes,
		 * 32-bit preamble.
		 */
		packet_conf.plen = NRF_RADIO_PREAMBLE_LENGTH_32BIT_ZERO;
		packet_conf.maxlen = IEEE_MAX_PAYLOAD_LEN;
		packet_conf.balen = 0;
		packet_conf.big_endian = false;
		packet_conf.whiteen = false;

		/* Set CRC length for IEEE 802.15.4 (2 bytes FCS) so CRCOK is reported */
#if defined(RADIO_CRCCNF_LEN_Two)
		nrf_radio_crc_configure(NRF_RADIO,
			RADIO_CRCCNF_LEN_Two,
			NRF_RADIO_CRC_ADDR_SKIP,
			0x1021);

		/* preamble, address (BALEN + PREFIX), lflen and payload */
		total_payload_size = 4 + (packet_conf.balen + 1) + 1 + packet_conf.maxlen;
		break;
#endif /* defined(RADIO_CRCCNF_LEN_Two) */

#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

#if CONFIG_HAS_HW_NRF_RADIO_BLE_CODED
	case NRF_RADIO_MODE_BLE_LR500KBIT:
	case NRF_RADIO_MODE_BLE_LR125KBIT:
		/* Packet configuration:
		 * S1 size = 0 bits,
		 * S0 size = 0 bytes,
		 * 10 bytes preamble.
		 */
		packet_conf.plen = NRF_RADIO_PREAMBLE_LENGTH_LONG_RANGE;
		packet_conf.cilen = 2;
		packet_conf.termlen = 3;
		packet_conf.big_endian = false;
		packet_conf.balen = 3;

		/* Set CRC length; CRC calculation does not include the address
		 * field.
		 */
		nrf_radio_crc_configure(NRF_RADIO, RADIO_CRCCNF_LEN_Three,
					NRF_RADIO_CRC_ADDR_SKIP, 0);

		/* preamble, address (BALEN + PREFIX), lflen, code indicator, TERM, payload, CRC */
		total_payload_size = 10 + (packet_conf.balen + 1) + 1 + packet_conf.cilen +
				  packet_conf.termlen + packet_conf.maxlen + RADIO_CRCCNF_LEN_Three;
		break;

#endif /* CONFIG_HAS_HW_NRF_RADIO_BLE_CODED */

	case NRF_RADIO_MODE_BLE_2MBIT:
		/* Packet configuration:
		 * S1 size = 0 bits,
		 * S0 size = 0 bytes,
		 * 16-bit preamble.
		 */
		packet_conf.plen = NRF_RADIO_PREAMBLE_LENGTH_16BIT;

		/* preamble, address (BALEN + PREFIX), lflen and payload */
		total_payload_size = 2 + (packet_conf.balen + 1) + 1 + packet_conf.maxlen;
		break;
#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_5)
	case NRF_RADIO_MODE_NRF_4MBIT_H_0_5:
		/* Packet configuration:
		 * S1 size = 0 bits,
		 * S0 size = 0 bytes,
		 * 16-bit preamble.
		 */
		packet_conf.plen = NRF_RADIO_PREAMBLE_LENGTH_16BIT;

		/* preamble, address (BALEN + PREFIX), lflen and payload */
		total_payload_size = 2 + (packet_conf.balen + 1) + 1 + packet_conf.maxlen;
		break;
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_5) */

#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_25)
	case NRF_RADIO_MODE_NRF_4MBIT_H_0_25:
		/* Packet configuration:
		 * S1 size = 0 bits,
		 * S0 size = 0 bytes,
		 * 16-bit preamble.
		 */
		packet_conf.plen = NRF_RADIO_PREAMBLE_LENGTH_16BIT;

		/* preamble, address (BALEN + PREFIX), lflen and payload */
		total_payload_size = 2 + (packet_conf.balen + 1) + 1 + packet_conf.maxlen;
		break;
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_25) */

