KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_test.c
#if defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT6)
	case NRF_RADIO_MODE_NRF_4MBIT_BT_0_6:
		/* Packet configuration:
		 * S1 size = 0 bits,
		 * S0 size = 0 bytes,
		 * 16-bit preamble.
		 */
		packet_conf.plen = NRF_RADIO_PREAMBLE_LENGTH_16BIT;

		/* preamble, address (BALEN + PREFIX), lflen and payload */
		total_payload_size = 2 + (packet_conf.balen + 1) + 1 + packet_conf.maxlen;
		break;
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT6) */

#if defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT4)
	case NRF_RADIO_MODE_NRF_4MBIT_BT_0_4:
		/* Packet configuration:
		 * S1 size = 0 bits,
		 * S0 size = 0 bytes,
		 * 16-bit preamble.
		 */
		packet_conf.plen = NRF_RADIO_PREAMBLE_LENGTH_16BIT;

		/* preamble, address (BALEN + PREFIX), lflen and payload */
		total_payload_size = 2 + (packet_conf.balen + 1) + 1 + packet_conf.maxlen;
		break;
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT4) */

	default:
		/* Packet configuration:
		 * S1 size = 0 bits,
		 * S0 size = 0 bytes,
		 * 8-bit preamble.
		 */
		packet_conf.plen = NRF_RADIO_PREAMBLE_LENGTH_8BIT;

		/* preamble, address (BALEN + PREFIX), lflen, and payload */
		total_payload_size = 1 + (packet_conf.balen + 1) + 1 + packet_conf.maxlen;
		break;
	}

	nrf_radio_packet_configure(NRF_RADIO, &packet_conf);
}

static void generate_modulated_rf_packet(uint8_t mode,
					 enum transmit_pattern pattern)
{
	radio_config(mode, pattern);

	/* One byte used for size, actual size is SIZE-1 */
#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	if (mode == NRF_RADIO_MODE_IEEE802154_250KBIT) {
		if (proto_tx_override_valid) {
			tx_packet[0] = proto_tx_override_len;
			memcpy(tx_packet + 1, proto_tx_override_payload, proto_tx_override_len);
			proto_tx_override_valid = false;
			nrf_radio_packetptr_set(NRF_RADIO, tx_packet);
			return;
		}

		tx_packet[0] = IEEE_MAX_PAYLOAD_LEN - 1;
	} else {
		tx_packet[0] = sizeof(tx_packet) - 1;
	}
#else
	tx_packet[0] = sizeof(tx_packet) - 1;
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

	switch (pattern) {
	case TRANSMIT_PATTERN_RANDOM:
		sys_rand_get(tx_packet + 1, sizeof(tx_packet) - 1);
		break;
	case TRANSMIT_PATTERN_11001100:
		memset(tx_packet + 1, 0xCC, sizeof(tx_packet) - 1);
		break;
	case TRANSMIT_PATTERN_11110000:
		memset(tx_packet + 1, 0xF0, sizeof(tx_packet) - 1);
		break;
	default:
		/* Do nothing. */
		break;
	}

	nrf_radio_packetptr_set(NRF_RADIO, tx_packet);
}

static void radio_disable(void)
{
	nrf_radio_shorts_set(NRF_RADIO, 0);
	nrf_radio_int_disable(NRF_RADIO, ~0);
	nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_DISABLED);

	nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_DISABLE);
	while (!nrf_radio_event_check(NRF_RADIO, NRF_RADIO_EVENT_DISABLED)) {
		/* Do nothing */
	}
	nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_DISABLED);

#if CONFIG_FEM
	fem_txrx_configuration_clear();
	fem_txrx_stop();

	/* Do not power-down front-end module (FEM) during sweeping. */
	if (!sweep_processing) {
		(void)fem_power_down();
	}
#endif /* CONFIG_FEM */

	test_is_running = false;
}

static void mltpan_6(nrf_radio_mode_t mode)
{
#if defined(NRF54L_SERIES)
	if (mode == NRF_RADIO_MODE_IEEE802154_250KBIT) {
		*((volatile uint32_t *)0x5008A810) = 2;
	}
#else
	ARG_UNUSED(mode);
#endif /* defined(NRF54L_SERIES) */
}

#if NRF53_ERRATA_117_PRESENT
static void errata_117(nrf_radio_mode_t mode)
{
	if (!nrf53_errata_117()) {
		return;
	}

	if ((mode == NRF_RADIO_MODE_NRF_2MBIT) ||
	    (mode == NRF_RADIO_MODE_BLE_2MBIT) ||
	    (mode == NRF_RADIO_MODE_IEEE802154_250KBIT)) {
		*((volatile uint32_t *)0x41008588) = *((volatile uint32_t *)0x01FF0084);
	} else {
		*((volatile uint32_t *)0x41008588) = *((volatile uint32_t *)0x01FF0080);
	}
}
#else
static void errata_117(nrf_radio_mode_t mode)
{
	ARG_UNUSED(mode);
}
#endif /* NRF53_ERRATA_117_PRESENT */

static void radio_mode_set(NRF_RADIO_Type *reg, nrf_radio_mode_t mode)
{
	errata_117(mode);
	nrf_radio_mode_set(reg, mode);
	mltpan_6(mode);
}

static void radio_unmodulated_tx_carrier(uint8_t mode, int8_t txpower, uint8_t channel)
{
	radio_disable();

	radio_mode_set(NRF_RADIO, mode);
	nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK);
	radio_power_set(mode, channel, txpower);

	radio_channel_set(mode, channel);

#if CONFIG_FEM
	(void)fem_configure(false, mode, &fem);
#else
	if (sweep_processing) {
		radio_ppi_config(false);
	}
#endif /* CONFIG_FEM */

	radio_start(false, sweep_processing);
}

static void radio_modulated_tx_carrier(uint8_t mode, int8_t txpower, uint8_t channel,
				       enum transmit_pattern pattern, uint32_t packets_num)
{
	radio_disable();
	generate_modulated_rf_packet(mode, pattern);

	switch (mode) {
#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154 || CONFIG_HAS_HW_NRF_RADIO_BLE_CODED
	case NRF_RADIO_MODE_IEEE802154_250KBIT:
	case NRF_RADIO_MODE_BLE_LR125KBIT:
	case NRF_RADIO_MODE_BLE_LR500KBIT:
		nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK);
		nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_PHYEND);
		nrf_radio_int_enable(NRF_RADIO, NRF_RADIO_INT_PHYEND_MASK);
		break;

#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 || CONFIG_HAS_HW_NRF_RADIO_BLE_CODED */

	case NRF_RADIO_MODE_BLE_1MBIT:
	case NRF_RADIO_MODE_BLE_2MBIT:
	case NRF_RADIO_MODE_NRF_1MBIT:
	case NRF_RADIO_MODE_NRF_2MBIT:
	default:
#if defined(RADIO_MODE_MODE_Nrf_250Kbit)
	case NRF_RADIO_MODE_NRF_250KBIT:
#endif /* defined(RADIO_MODE_MODE_Nrf_250Kbit) */
#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_5)
	case NRF_RADIO_MODE_NRF_4MBIT_H_0_5:
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_5) */
#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_25)
	case NRF_RADIO_MODE_NRF_4MBIT_H_0_25:
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_25) */
#if defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT6)
	case NRF_RADIO_MODE_NRF_4MBIT_BT_0_6:
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT6) */
#if defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT4)
	case NRF_RADIO_MODE_NRF_4MBIT_BT_0_4:
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit_0BT4) */
		nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK);
		nrf_radio_event_clear(NRF_RADIO, RADIO_TEST_EVENT_END);
		nrf_radio_int_enable(NRF_RADIO, RADIO_TEST_INT_END_MASK);
		break;
	}

	radio_mode_set(NRF_RADIO, mode);
	radio_power_set(mode, channel, txpower);

	radio_channel_set(mode, channel);
	tx_packet_cnt = 0;

#if CONFIG_FEM
	(void)fem_configure(false, mode, &fem);
#endif /* CONFIG_FEM */

	radio_start(false, false);
}

