KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_test.c
static void timer_handler(nrf_timer_event_t event_type, void *context)
{
	const struct radio_test_config *config =
		(const struct radio_test_config *) context;

	if (event_type == NRF_TIMER_EVENT_COMPARE0) { /* sweep test running */
		uint8_t channel_start;
		uint8_t channel_end;

		if (config->type == TX_SWEEP) {
			sweep_processing = true;
			radio_unmodulated_tx_carrier(config->mode,
				config->params.tx_sweep.txpower,
				current_channel);

			channel_start = config->params.tx_sweep.channel_start;
			channel_end = config->params.tx_sweep.channel_end;
		} else if (config->type == RX_SWEEP) {
			sweep_processing = true;
			radio_rx(config->mode,
				current_channel,
				config->params.rx.pattern,
				0);

			channel_start = config->params.rx_sweep.channel_start;
			channel_end = config->params.rx_sweep.channel_end;
		} else {
			printk("Unexpected test type: %d\n", config->type);
			return;
		}

		sweep_processing = false;

		current_channel++;
		if (current_channel > channel_end) {
			current_channel = channel_start;
		}
	} else if (event_type == NRF_TIMER_EVENT_COMPARE1) { /* HMPAN-216 errata */
		errata_216_release();
	} else {
		/* Do nothing */
	}
}

static void timer_init(const struct radio_test_config *config)
{
	int                 err;
	nrfx_timer_config_t timer_cfg = {
		.frequency = NRFX_MHZ_TO_HZ(1),
		.mode      = NRF_TIMER_MODE_TIMER,
		.bit_width = NRF_TIMER_BIT_WIDTH_24,
		.p_context = (void *) config,
	};

	err = nrfx_timer_init(&timer, &timer_cfg, timer_handler);
	if (err != 0) {
		printk("nrfx_timer_init failed with: %d\n", err);
	}
}

void on_radio_end(const struct radio_test_config *config)
{
	tx_packet_cnt++;

	uint32_t packets_num;
	void (*cb)(void);

	if (config->type == MODULATED_TX) {
		packets_num = config->params.modulated_tx.packets_num;
		cb = config->params.modulated_tx.cb;
	} else if (config->type == MODULATED_TX_DUTY_CYCLE) {
		packets_num = config->params.modulated_tx_duty_cycle.packets_num;
		cb = config->params.modulated_tx_duty_cycle.cb;
	} else {
		return;
	}

	if (packets_num != 0 && tx_packet_cnt >= packets_num) {
		radio_disable();
		/* Send off signal for nRF54H20 errata HMPAN-216 */
		if (errata_216_off()) {
			printk("Failed to send errata HMPAN-216 off\n");
		}
		if (cb != NULL) {
			cb();
		}
	} else if (cancel_request) {
		cancel();
	} else if (config->type == MODULATED_TX) {
		/* Duty cycle mode re-triggers via hardware timer; plain MODULATED_TX
		 * must retrigger manually here.
		 */
		nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_START);
	}
}

void radio_handler(const void *context)
{
	const struct radio_test_config *config =
		(const struct radio_test_config *) context;

	/* Trigger RSSISTART at ADDRESS so RSSISAMPLE is populated by CRCOK. */
	if (nrf_radio_int_enable_check(NRF_RADIO, NRF_RADIO_INT_ADDRESS_MASK) &&
	    nrf_radio_event_check(NRF_RADIO, NRF_RADIO_EVENT_ADDRESS)) {
		nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_ADDRESS);
		nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_RSSISTART);
	}

	if (nrf_radio_int_enable_check(NRF_RADIO, NRF_RADIO_INT_CRCOK_MASK) &&
	    nrf_radio_event_check(NRF_RADIO, NRF_RADIO_EVENT_CRCOK)) {
		int16_t rssi_dbm;

		nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_CRCOK);
		/* Read RSSISAMPLE — triggered at ADDRESS event, ready by CRCOK. */
		rssi_dbm = radio_read_last_rx_rssi_dbm();

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
		if (nrf_radio_mode_get(NRF_RADIO) == NRF_RADIO_MODE_IEEE802154_250KBIT) {
			uint8_t payload_len = rx_packet[0];
			struct radio_proto_frame frame;
			bool frame_ok = proto_frame_decode(rx_packet + 1, payload_len, &frame);

			if (frame_ok) {
				if (rssi_dbm == INT16_MIN) {
					printk("RX_RSSI,src=0x%08X,NA\n", frame.src_signature);
				} else {
					printk("RX_RSSI,src=0x%08X,%d dBm\n", frame.src_signature, rssi_dbm);
				}
				rx_packet_cnt++;
				radio_node_note_proto_frame_activity(frame.src_signature);

				switch (frame.cmd) {
				case RADIO_PROTO_CMD_DISCOVER_REQ:
					if (VERBOSE_LOGGING) printk("Received DISCOVER_REQ from 0x%08X\n", frame.src_signature);
					proto_discover_req_seen++;
					radio_node_handle_discover_req(frame.src_signature,
							      frame.dst_signature);
					break;
				case RADIO_PROTO_CMD_DISCOVER_RSP:
					if (VERBOSE_LOGGING) printk("Received DISCOVER_RSP from 0x%08X\n", frame.src_signature);
					proto_discover_rsp_seen++;
					if (proto_role == RADIO_PROTO_ROLE_TX &&
					    proto_frame_for_me(frame.dst_signature)) {
						struct radio_proto_peer *peer =
							proto_find_or_add_peer(frame.src_signature);

						if (peer != NULL) {
							if (VERBOSE_LOGGING) printk("Discovered peer 0x%08X\n", frame.src_signature);
							peer->seen_discover_rsp = true;
							proto_peer_profile_apply(peer, frame.aux_signature);
						}
					} else if (VERBOSE_LOGGING) {
						printk("Ignoring DISCOVER_RSP from 0x%08X (role=%u dst=0x%08X local=0x%08X)\n",
						       frame.src_signature,
						       (uint32_t)proto_role,
						       frame.dst_signature,
						       proto_local_signature);
					}
					break;
				case RADIO_PROTO_CMD_TEST_DATA:
					proto_test_data_seen++;
					if (proto_role == RADIO_PROTO_ROLE_RX &&
					    proto_frame_for_me(frame.dst_signature) &&
					    proto_test_session_active &&
					    frame.src_signature == proto_test_session_broadcaster) {
						proto_local_test_data_rx++;
					}
					break;
				case RADIO_PROTO_CMD_PER_REQ:
					if (VERBOSE_LOGGING) printk("Received PER_REQ from 0x%08X\n", frame.src_signature);
					proto_per_req_seen++;
					if (proto_role == RADIO_PROTO_ROLE_RX &&
					    proto_frame_for_me(frame.dst_signature)) {
						radio_proto_schedule_response(RADIO_PROTO_CMD_PER_RSP,
								      frame.src_signature,
								      (uint16_t)MIN(proto_local_test_data_rx,
										  UINT16_MAX));
					}
					break;
				case RADIO_PROTO_CMD_PER_RSP:
					if (VERBOSE_LOGGING) printk("Received PER_RSP from 0x%08X\n", frame.src_signature);
					proto_per_rsp_seen++;
					if (proto_role == RADIO_PROTO_ROLE_TX &&
					    proto_frame_for_me(frame.dst_signature)) {
						struct radio_proto_peer *peer =
							proto_find_or_add_peer(frame.src_signature);

						if (peer != NULL) {
							if (VERBOSE_LOGGING) printk("Received PER_RSP from peer 0x%08X with value %u\n", frame.src_signature, frame.value);
							peer->seen_per_rsp = true;
							peer->reported_rx_packets = frame.value;
						}
					}
					break;
				case RADIO_PROTO_CMD_CLEAR_PER_REQ:
					if (VERBOSE_LOGGING) printk("Received CLEAR_PER_REQ from 0x%08X\n", frame.src_signature);
					if (proto_role == RADIO_PROTO_ROLE_RX &&
					    proto_frame_for_me(frame.dst_signature)) {
						proto_test_session_active = false;
						proto_test_session_broadcaster = 0u;
						proto_local_test_data_rx = 0;
						radio_proto_schedule_response(RADIO_PROTO_CMD_CLEAR_PER_RSP,
									      frame.src_signature,
									      0);
					}
					break;
				case RADIO_PROTO_CMD_CLEAR_PER_RSP:
					if (VERBOSE_LOGGING) printk("Received CLEAR_PER_RSP from 0x%08X\n", frame.src_signature);
					if (proto_role == RADIO_PROTO_ROLE_TX &&
					    proto_frame_for_me(frame.dst_signature)) {
						struct radio_proto_peer *peer =
							proto_find_or_add_peer(frame.src_signature);

						if (peer != NULL) {
							peer->seen_clear_per_rsp = true;
						}
					}
					break;
				case RADIO_PROTO_CMD_RELEASE_REQ:
					if (VERBOSE_LOGGING) printk("Received RELEASE_REQ from 0x%08X\n", frame.src_signature);
					radio_node_handle_proto_frame(&frame);
					break;
				case RADIO_PROTO_CMD_RELEASE_RSP:
					if (VERBOSE_LOGGING) printk("Received RELEASE_RSP from 0x%08X\n", frame.src_signature);
					if (proto_role == RADIO_PROTO_ROLE_TX &&
					    proto_frame_for_me(frame.dst_signature)) {
						struct radio_proto_peer *peer =
							proto_find_or_add_peer(frame.src_signature);

						if (peer != NULL) {
							peer->seen_release_rsp = true;
						}
					} else if (VERBOSE_LOGGING) {
						printk("Ignoring RELEASE_RSP from 0x%08X (role=%u dst=0x%08X local=0x%08X)\n",
						       frame.src_signature,
						       (uint32_t)proto_role,
						       frame.dst_signature,
						       proto_local_signature);
					}
					break;
				case RADIO_PROTO_CMD_REMOTE_TEST_REQ:
				case RADIO_PROTO_CMD_REMOTE_TEST_REQ_ACK:
				case RADIO_PROTO_CMD_REMOTE_TEST_REPORT:
				case RADIO_PROTO_CMD_REMOTE_TEST_DONE:
				case RADIO_PROTO_CMD_REMOTE_TEST_REPORT_ACK:
				case RADIO_PROTO_CMD_REMOTE_TEST_DONE_ACK:
				case RADIO_PROTO_CMD_CONTROL_ACK:
				case RADIO_PROTO_CMD_SHARED_LIST_CLEAR:
				case RADIO_PROTO_CMD_SHARED_LIST_ADD:
				case RADIO_PROTO_CMD_TEST_START:
				case RADIO_PROTO_CMD_TEST_END:
				case RADIO_PROTO_CMD_PROVISION_REQ:
				case RADIO_PROTO_CMD_PROVISION_RSP:
					radio_node_handle_proto_frame(&frame);
					break;
				default:
					break;
				}
			} else {
				if (rssi_dbm == INT16_MIN) {
					printk("RX_RSSI,src=unknown,NA\n");
				} else {
					printk("RX_RSSI,src=unknown,%d dBm\n", rssi_dbm);
				}
				rx_packet_cnt++;
			}
		} else {
			if (rssi_dbm == INT16_MIN) {
				printk("RX_RSSI,src=unknown,NA\n");
			} else {
				printk("RX_RSSI,src=unknown,%d dBm\n", rssi_dbm);
			}
			rx_packet_cnt++;
		}
#else
		if (rssi_dbm == INT16_MIN) {
			printk("RX_RSSI,src=unknown,NA\n");
		} else {
			printk("RX_RSSI,src=unknown,%d dBm\n", rssi_dbm);
		}
		rx_packet_cnt++;
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

		if (config->params.rx.packets_num) {
			if (rx_packet_cnt == config->params.rx.packets_num) {
				k_work_reschedule(&rx_timeout_work, K_NO_WAIT);
			} else {
				k_work_reschedule(&rx_timeout_work, K_MSEC(RX_PACKET_TIMEOUT_MS));
			}
		}
	}

#if defined(RADIO_INTENSET_PHYEND_Msk) || defined(RADIO_INTENSET00_PHYEND_Msk)
	if (nrf_radio_int_enable_check(NRF_RADIO, NRF_RADIO_INT_PHYEND_MASK) &&
		nrf_radio_event_check(NRF_RADIO, NRF_RADIO_EVENT_PHYEND)) {
		nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_PHYEND);
		if (proto_resume_rx_after_rsp) {
			proto_resume_rx_after_rsp = false;
			radio_rx(NRF_RADIO_MODE_IEEE802154_250KBIT,
				 proto_rx_channel,
				 proto_rx_pattern,
				 0);
		} else if (config->type == MODULATED_TX ||
			   config->type == MODULATED_TX_DUTY_CYCLE) {
			on_radio_end(config);
		}
	}
#endif /* defined(RADIO_INTENSET_PHYEND_Msk) || defined(RADIO_INTENSET00_PHYEND_Msk) */

	if (nrf_radio_int_enable_check(NRF_RADIO, NRF_RADIO_INT_END_MASK) &&
		nrf_radio_event_check(NRF_RADIO, NRF_RADIO_EVENT_END)) {
		nrf_radio_event_clear(NRF_RADIO, NRF_RADIO_EVENT_END);

		if (config->type == MODULATED_TX ||
		    config->type == MODULATED_TX_DUTY_CYCLE) {
			on_radio_end(config);
		}
	}
}

static void proto_rsp_work_handler(struct k_work *work)
{
	ARG_UNUSED(work);

	if (!proto_rsp_pending || proto_role != RADIO_PROTO_ROLE_RX) {
		return;
	}

	if (radio_proto_prepare_tx_ext(proto_rsp_cmd,
				      proto_rsp_dst_sig,
				      proto_rsp_value,
				      proto_rsp_cmd == RADIO_PROTO_CMD_DISCOVER_RSP ?
				      proto_local_profile_pack() : proto_rsp_aux_sig) != 0) {
		return;
	}

