KalebOTB/xiao_nrf54l15_site_survey_fw/src/radio_test.c
	proto_rsp_pending = false;
	proto_resume_rx_after_rsp = true;

	radio_disable();
	radio_modulated_tx_carrier(NRF_RADIO_MODE_IEEE802154_250KBIT,
				   proto_response_txpower_dbm,
				   proto_rx_channel,
				   TRANSMIT_PATTERN_RANDOM,
				   1);
}

void radio_proto_set_signature(uint32_t signature)
{
	proto_local_signature = signature;
}

void radio_proto_set_response_txpower(int8_t txpower)
{
	proto_response_txpower_dbm = txpower;
}

void radio_proto_set_local_node_profile(enum radio_survey_node_type node_type,
					      bool is_data_aggregator)
{
	if (node_type == RADIO_SURVEY_NODE_TYPE_X || node_type == RADIO_SURVEY_NODE_TYPE_Y) {
		proto_local_node_type = node_type;
	} else {
		proto_local_node_type = RADIO_SURVEY_NODE_TYPE_UNKNOWN;
	}

	proto_local_is_aggregator = is_data_aggregator;
}

void radio_proto_set_role(enum radio_proto_role role)
{
	proto_role = role;
}

enum radio_proto_role radio_proto_get_role(void)
{
	return proto_role;
}

enum radio_survey_node_type radio_proto_get_local_node_type(void)
{
	return proto_local_node_type;
}

bool radio_proto_get_local_aggregator(void)
{
	return proto_local_is_aggregator;
}

void radio_proto_begin_test_session(uint32_t broadcaster_signature)
{
	proto_test_session_broadcaster = broadcaster_signature;
	proto_test_session_active = true;
	proto_local_test_data_rx = 0u;
}

void radio_proto_end_test_session(uint32_t broadcaster_signature)
{
	if (broadcaster_signature != 0u &&
	    proto_test_session_broadcaster != 0u &&
	    proto_test_session_broadcaster != broadcaster_signature) {
		return;
	}

	proto_test_session_active = false;
	proto_test_session_broadcaster = 0u;
}

void radio_proto_reset_local_test_counter(void)
{
	proto_local_test_data_rx = 0u;
	proto_test_session_active = false;
	proto_test_session_broadcaster = 0u;
}

void radio_proto_reset(void)
{
	proto_discover_req_seen = 0;
	proto_discover_rsp_seen = 0;
	proto_test_data_seen = 0;
	proto_per_req_seen = 0;
	proto_per_rsp_seen = 0;
	proto_local_test_data_rx = 0;
	proto_test_session_active = false;
	proto_test_session_broadcaster = 0u;
	proto_peer_count = 0;
	proto_rsp_pending = false;
	proto_resume_rx_after_rsp = false;
	k_work_cancel_delayable(&proto_rsp_work);
	memset(proto_peers, 0, sizeof(proto_peers));
}

int radio_proto_prepare_tx_ext(enum radio_proto_cmd cmd, uint32_t dst_signature,
			       uint16_t value, uint32_t aux_signature)
{
	uint8_t len;

	if (proto_local_signature == 0u) {
		return -EINVAL;
	}

	len = proto_frame_encode(proto_tx_override_payload,
				 sizeof(proto_tx_override_payload),
				 cmd,
				 proto_local_signature,
				 dst_signature,
				 aux_signature,
				 value);
	if (len == 0) {
		return -EINVAL;
	}

	proto_tx_override_len = len;
	proto_tx_override_valid = true;

	return 0;
}

int radio_proto_prepare_tx(enum radio_proto_cmd cmd, uint32_t dst_signature, uint16_t value)
{
	return radio_proto_prepare_tx_ext(cmd, dst_signature, value, 0u);
}

int radio_proto_prepare_tx_raw(enum radio_proto_cmd cmd,
			       uint8_t flags,
			       uint32_t src_signature,
			       uint32_t dst_signature,
			       uint16_t value,
			       uint32_t aux_signature)
{
	uint8_t len;

	if (src_signature == 0u) {
		return -EINVAL;
	}

	len = proto_frame_encode_raw(proto_tx_override_payload,
				 sizeof(proto_tx_override_payload),
				 cmd,
				 flags,
				 src_signature,
				 dst_signature,
				 aux_signature,
				 value);
	if (len == 0) {
		return -EINVAL;
	}

	proto_tx_override_len = len;
	proto_tx_override_valid = true;

	return 0;
}

void radio_proto_get_status(struct radio_proto_status *status)
{
	if (status == NULL) {
		return;
	}

	memset(status, 0, sizeof(*status));
	status->role = proto_role;
	status->local_signature = proto_local_signature;
	status->discover_req_seen = proto_discover_req_seen;
	status->discover_rsp_seen = proto_discover_rsp_seen;
	status->test_data_seen = proto_test_data_seen;
	status->per_req_seen = proto_per_req_seen;
	status->per_rsp_seen = proto_per_rsp_seen;
	status->local_test_data_rx = proto_local_test_data_rx;
	status->peer_count = proto_peer_count;
	for (uint8_t i = 0; i < proto_peer_count; i++) {
		status->peers[i] = proto_peers[i];
	}
}

uint8_t radio_proto_get_peer_signatures(uint32_t *signatures, uint8_t max_count)
{
	uint8_t count = MIN(max_count, proto_peer_count);

	for (uint8_t i = 0; i < count; i++) {
		signatures[i] = proto_peers[i].signature;
	}

	return count;
}

void radio_proto_clear_peer_list(void)
{
	proto_peer_count = 0;
	memset(proto_peers, 0, sizeof(proto_peers));
	proto_discover_rsp_seen = 0;
	proto_per_rsp_seen = 0;
}

void radio_proto_reset_discover_round(void)
{
	proto_discover_req_seen = 0;
	proto_discover_rsp_seen = 0;

	for (uint8_t i = 0; i < proto_peer_count; i++) {
		proto_peers[i].seen_discover_rsp = false;
	}
}

void radio_proto_reset_per_results(void)
{
	proto_per_req_seen = 0;
	proto_per_rsp_seen = 0;

	for (uint8_t i = 0; i < proto_peer_count; i++) {
		proto_peers[i].seen_per_rsp = false;
		proto_peers[i].reported_rx_packets = 0;
	}
}

void radio_proto_reset_clear_per_results(void)
{
	for (uint8_t i = 0; i < proto_peer_count; i++) {
		proto_peers[i].seen_clear_per_rsp = false;
	}
}

void radio_proto_reset_release_results(void)
{
	for (uint8_t i = 0; i < proto_peer_count; i++) {
		proto_peers[i].seen_release_rsp = false;
	}
}

int radio_test_init(struct radio_test_config *config)
{
	int nrfx_err;
	uint32_t rad_domain = nrfx_gppi_domain_id_get((uint32_t)NRF_RADIO);

	timer_init(config);
	IRQ_CONNECT(RADIO_TEST_TIMER_IRQn, IRQ_PRIO_LOWEST,
		nrfx_timer_irq_handler, &timer, 0);

	irq_connect_dynamic(RADIO_TEST_RADIO_IRQn, IRQ_PRIO_LOWEST, radio_handler, config, 0);
	irq_enable(RADIO_TEST_RADIO_IRQn);

	nrfx_err = nrfx_gppi_domain_conn_alloc(rad_domain, rad_domain, &ppi_radio_start);
	if (nrfx_err != 0) {
		printk("Failed to allocate gppi channel.\n");
		return -EFAULT;
	}

	rx_timeout_cb = &config->params.rx.cb;

	if (proto_local_signature == 0u) {
		proto_local_signature = sys_rand32_get();
	}
	radio_proto_reset();

#if CONFIG_FEM
	int err = fem_init(timer.p_reg,
			   (BIT(NRF_TIMER_CC_CHANNEL2) | BIT(NRF_TIMER_CC_CHANNEL3)));

	if (err) {
		return err;
	}
#endif /* CONFIG_FEM */

	return 0;
}
